/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   err_msg_lib_func.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kharuya <haruya.0411.k@gmail.com>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/09 13:39:34 by kharuya           #+#    #+#             */
/*   Updated: 2025/05/22 03:57:12 by kharuya          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/h_minishell.h"

int	err_msg_malloc(void)
{
	perror(ERROR_MALLOC);
	return (EXIT_S_FAILURE);
}

// ここではエラーメッセージと共にfreeが必要なものをfreeするが、
//まだ構造体の構成がはっきりしていないので、後から処理を追加する。
