/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   err_msg_lib_func.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: katakada <katakada@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/09 13:39:34 by kharuya           #+#    #+#             */
/*   Updated: 2025/05/23 01:32:04 by katakada         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "exec.h"

int	err_msg_malloc(void)
{
	perror(ERROR_MALLOC);
	return (EXIT_S_FAILURE);
}

// ここではエラーメッセージと共にfreeが必要なものをfreeするが、
//まだ構造体の構成がはっきりしていないので、後から処理を追加する。
